apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
/****************************************************************************
 * arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_PINMAP_H
#define __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_PINMAP_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "stm32_gpio.h"

#ifdef CONFIG_STM32_STM32H7RSXX

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Alternate Pin Functions.
 * All members of the STM32H7RSxx family share the same pin multiplexing
 * (although they may differ in the pins physically available).
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2,
 * etc. Drivers, however, will use the pin selection without the numeric
 * suffix.
 * Additional definitions are required in the board.h file.  For example,
 * if CAN1_RX connects via PA11 on some board, then the following definitions
 * should appear in the board.h header file for that board:
 *
 * #define GPIO_CAN1_RX GPIO_CAN1_RX_1
 *
 * The driver will then automatically configure PA11 as the CAN1 RX pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as
 * open-drain/push-pull and pull-up/down!  Just the basics are defined for
 * most pins in this file.
 */

/* ADC1 */

#define GPIO_ADC1_INN1_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN0)
#define GPIO_ADC1_INP0_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN0)
#define GPIO_ADC1_INP1_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN1)
#define GPIO_ADC1_INP14_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN2)
#define GPIO_ADC1_INP15_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN3)
#define GPIO_ADC1_INP18_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN4)
#define GPIO_ADC1_INP3_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN6)
#define GPIO_ADC1_INN3_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ADC1_INP7_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ADC1_INN5_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ADC1_INP9_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ADC1_INP5_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN1)
#define GPIO_ADC1_INP10_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN0)
#define GPIO_ADC1_INN10_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ADC1_INP11_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ADC1_INN11_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ADC1_INP12_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ADC1_INN12_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ADC1_INP13_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ADC1_INP4_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN4)
#define GPIO_ADC1_INN4_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ADC1_INP8_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ADC1_INP2_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN11)
#define GPIO_ADC1_INN2_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN12)
#define GPIO_ADC1_INP6_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN12)

/* ADC2 */

#define GPIO_ADC2_INN1_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN0)
#define GPIO_ADC2_INP0_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN0)
#define GPIO_ADC2_INP1_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN1)
#define GPIO_ADC2_INP14_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN2)
#define GPIO_ADC2_INP15_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN3)
#define GPIO_ADC2_INP18_0        (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN5)
#define GPIO_ADC2_INP3_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN6)
#define GPIO_ADC2_INN3_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ADC2_INP7_0         (GPIO_ANALOG|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ADC2_INN5_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ADC2_INP9_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ADC2_INP5_0         (GPIO_ANALOG|GPIO_PORTB|GPIO_PIN1)
#define GPIO_ADC2_INP10_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN0)
#define GPIO_ADC2_INN10_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ADC2_INP11_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ADC2_INN11_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ADC2_INP12_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ADC2_INN12_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ADC2_INP13_0        (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ADC2_INP4_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN4)
#define GPIO_ADC2_INN4_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ADC2_INP8_0         (GPIO_ANALOG|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ADC2_INP2_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN13)
#define GPIO_ADC2_INN2_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN14)
#define GPIO_ADC2_INP6_0         (GPIO_ANALOG|GPIO_PORTF|GPIO_PIN14)

/* Digital camera interface pixel pipeline */

#define GPIO_DCMIPP_D0_1         (GPIO_ALT|GPIO_AF5|GPIO_PORTA|GPIO_PIN1)
#define GPIO_DCMIPP_D0_2         (GPIO_ALT|GPIO_AF13|GPIO_PORTA|GPIO_PIN9)
#define GPIO_DCMIPP_D0_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN6)
#define GPIO_DCMIPP_D1_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTA|GPIO_PIN10)
#define GPIO_DCMIPP_D1_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN7)
#define GPIO_DCMIPP_D1_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN7)
#define GPIO_DCMIPP_D2_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN13)
#define GPIO_DCMIPP_D2_2         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN8)
#define GPIO_DCMIPP_D2_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN7)
#define GPIO_DCMIPP_D2_4         (GPIO_ALT|GPIO_AF13|GPIO_PORTE|GPIO_PIN0)
#define GPIO_DCMIPP_D2_5         (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN10)
#define GPIO_DCMIPP_D3_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN9)
#define GPIO_DCMIPP_D3_2         (GPIO_ALT|GPIO_AF13|GPIO_PORTE|GPIO_PIN1)
#define GPIO_DCMIPP_D3_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN11)
#define GPIO_DCMIPP_D4_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN11)
#define GPIO_DCMIPP_D4_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN10)
#define GPIO_DCMIPP_D4_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTE|GPIO_PIN4)
#define GPIO_DCMIPP_D5_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN6)
#define GPIO_DCMIPP_D5_2         (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN3)
#define GPIO_DCMIPP_D6_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN8)
#define GPIO_DCMIPP_D6_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN11)
#define GPIO_DCMIPP_D6_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTE|GPIO_PIN5)
#define GPIO_DCMIPP_D7_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN9)
#define GPIO_DCMIPP_D7_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN14)
#define GPIO_DCMIPP_D7_3         (GPIO_ALT|GPIO_AF13|GPIO_PORTE|GPIO_PIN6)
#define GPIO_DCMIPP_D8_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTA|GPIO_PIN5)
#define GPIO_DCMIPP_D8_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTF|GPIO_PIN4)
#define GPIO_DCMIPP_D9_1         (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN12)
#define GPIO_DCMIPP_D9_2         (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN15)
#define GPIO_DCMIPP_D9_3         (GPIO_ALT|GPIO_AF5|GPIO_PORTF|GPIO_PIN3)
#define GPIO_DCMIPP_D10_1        (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN5)
#define GPIO_DCMIPP_D10_2        (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN6)
#define GPIO_DCMIPP_D10_3        (GPIO_ALT|GPIO_AF13|GPIO_PORTF|GPIO_PIN13)
#define GPIO_DCMIPP_D11_1        (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN2)
#define GPIO_DCMIPP_D11_2        (GPIO_ALT|GPIO_AF13|GPIO_PORTF|GPIO_PIN10)
#define GPIO_DCMIPP_D12_1        (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN12)
#define GPIO_DCMIPP_D12_2        (GPIO_ALT|GPIO_AF13|GPIO_PORTF|GPIO_PIN11)
#define GPIO_DCMIPP_D12_3        (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN6)
#define GPIO_DCMIPP_D13_1        (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN13)
#define GPIO_DCMIPP_D13_2        (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN7)
#define GPIO_DCMIPP_D13_3        (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN15)
#define GPIO_DCMIPP_D14_1        (GPIO_ALT|GPIO_AF13|GPIO_PORTC|GPIO_PIN10)
#define GPIO_DCMIPP_D14_2        (GPIO_ALT|GPIO_AF5|GPIO_PORTF|GPIO_PIN2)
#define GPIO_DCMIPP_D15_1        (GPIO_ALT|GPIO_AF4|GPIO_PORTC|GPIO_PIN5)
#define GPIO_DCMIPP_D15_2        (GPIO_ALT|GPIO_AF5|GPIO_PORTF|GPIO_PIN5)
#define GPIO_DCMIPP_D15_3        (GPIO_ALT|GPIO_AF4|GPIO_PORTF|GPIO_PIN10)
#define GPIO_DCMIPP_HSYNC_1      (GPIO_ALT|GPIO_AF13|GPIO_PORTA|GPIO_PIN4)
#define GPIO_DCMIPP_HSYNC_2      (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN3)
#define GPIO_DCMIPP_HSYNC_3      (GPIO_ALT|GPIO_AF13|GPIO_PORTD|GPIO_PIN0)
#define GPIO_DCMIPP_HSYNC_4      (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN4)
#define GPIO_DCMIPP_HSYNC_5      (GPIO_ALT|GPIO_AF5|GPIO_PORTG|GPIO_PIN3)
#define GPIO_DCMIPP_VSYNC_1      (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN4)
#define GPIO_DCMIPP_VSYNC_2      (GPIO_ALT|GPIO_AF13|GPIO_PORTB|GPIO_PIN7)
#define GPIO_DCMIPP_VSYNC_3      (GPIO_ALT|GPIO_AF13|GPIO_PORTG|GPIO_PIN9)
#define GPIO_DCMIPP_PIXCLK_1     (GPIO_ALT|GPIO_AF13|GPIO_PORTA|GPIO_PIN6)
#define GPIO_DCMIPP_PIXCLK_2     (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN5)
#define GPIO_DCMIPP_PIXCLK_3     (GPIO_ALT|GPIO_AF4|GPIO_PORTF|GPIO_PIN8)

/* FDCAN */

#define GPIO_CAN1_RX_1           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN11)
#define GPIO_CAN1_RX_2           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN8)
#define GPIO_CAN1_RX_3           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN0)
#define GPIO_CAN1_TX_1           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_CAN1_TX_2           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN9)
#define GPIO_CAN1_TX_3           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN1)

#define GPIO_CAN2_RX_1           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN5)
#define GPIO_CAN2_RX_2           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN12)
#define GPIO_CAN2_TX_1           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN1)
#define GPIO_CAN2_TX_2           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN6)
#define GPIO_CAN2_TX_3           (GPIO_ALT|GPIO_AF9|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN13)

/* Ethernet */

#define GPIO_ETH_MDIO_1          (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN2)
#define GPIO_ETH_MDIO_2          (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN4)
#define GPIO_ETH_MDC_1           (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ETH_MDC_2           (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN6)
#define GPIO_ETH_PPS_OUT_1       (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN5)
#define GPIO_ETH_PPS_OUT_2       (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN3)
#define GPIO_ETH_PPS_OUT_3       (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN8)

#define GPIO_ETH_MII_RX_CLK_1    (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN1)
#define GPIO_ETH_MII_RX_CLK_2    (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN6)
#define GPIO_ETH_MII_RX_CLK_3    (GPIO_ALT|GPIO_AF4|GPIO_PORTD|GPIO_PIN7)
#define GPIO_ETH_MII_COL_1       (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN3)
#define GPIO_ETH_MII_CRS_1       (GPIO_ALT|GPIO_AF11|GPIO_PORTF|GPIO_PIN3)
#define GPIO_ETH_MII_RX_DV_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ETH_MII_RX_ER_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN10)
#define GPIO_ETH_MII_RXD0_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN4)
#define GPIO_ETH_MII_RXD0_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN4)
#define GPIO_ETH_MII_RXD1_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ETH_MII_RXD1_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN5)
#define GPIO_ETH_MII_RXD2_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTF|GPIO_PIN5)
#define GPIO_ETH_MII_RXD3_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN13)
#define GPIO_ETH_MII_RXD3_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTE|GPIO_PIN3)
#define GPIO_ETH_MII_TX_CLK_1    (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ETH_MII_TX_EN_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN11)
#define GPIO_ETH_MII_TX_EN_2     (GPIO_ALT|GPIO_AF11|GPIO_PORTD|GPIO_PIN8)
#define GPIO_ETH_MII_TX_EN_3     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN11)
#define GPIO_ETH_MII_TXD0_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ETH_MII_TXD0_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN13)
#define GPIO_ETH_MII_TXD1_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN1)
#define GPIO_ETH_MII_TXD1_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN7)
#define GPIO_ETH_MII_TXD1_3      (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN12)
#define GPIO_ETH_MII_TXD1_4      (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN14)
#define GPIO_ETH_MII_TXD2_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ETH_MII_TXD3_1      (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN8)
#define GPIO_ETH_MII_TXD3_2      (GPIO_ALT|GPIO_AF11|GPIO_PORTE|GPIO_PIN2)

#define GPIO_ETH_RMII_REF_CLK_1  (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN1)
#define GPIO_ETH_RMII_REF_CLK_2  (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN6)
#define GPIO_ETH_RMII_REF_CLK_3  (GPIO_ALT|GPIO_AF4|GPIO_PORTD|GPIO_PIN7)
#define GPIO_ETH_RMII_CRS_DV_1   (GPIO_ALT|GPIO_AF11|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ETH_RMII_RXD0_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN4)
#define GPIO_ETH_RMII_RXD0_2     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN4)
#define GPIO_ETH_RMII_RXD1_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ETH_RMII_RXD1_2     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN5)
#define GPIO_ETH_RMII_TX_EN_1    (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN11)
#define GPIO_ETH_RMII_TX_EN_2    (GPIO_ALT|GPIO_AF11|GPIO_PORTD|GPIO_PIN8)
#define GPIO_ETH_RMII_TX_EN_3    (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN11)
#define GPIO_ETH_RMII_TXD0_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ETH_RMII_TXD0_2     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN13)
#define GPIO_ETH_RMII_TXD1_1     (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN1)
#define GPIO_ETH_RMII_TXD1_2     (GPIO_ALT|GPIO_AF11|GPIO_PORTB|GPIO_PIN7)
#define GPIO_ETH_RMII_TXD1_3     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN12)
#define GPIO_ETH_RMII_TXD1_4     (GPIO_ALT|GPIO_AF11|GPIO_PORTG|GPIO_PIN14)

/* Flexible memory controller */

