apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
#define GPIO_FMC_A0_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN1)
#define GPIO_FMC_A1_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN2)
#define GPIO_FMC_A2_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN3)
#define GPIO_FMC_A3_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN4)
#define GPIO_FMC_A4_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN7)
#define GPIO_FMC_A5_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN5)
#define GPIO_FMC_A6_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN0)
#define GPIO_FMC_A7_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN1)
#define GPIO_FMC_A8_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN0)
#define GPIO_FMC_A9_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN1)
#define GPIO_FMC_A10_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN2)
#define GPIO_FMC_A11_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN3)
#define GPIO_FMC_A12_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN8)
#define GPIO_FMC_A13_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN4)
#define GPIO_FMC_A14_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN9)
#define GPIO_FMC_A15_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN10)
#define GPIO_FMC_A16_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN1)
#define GPIO_FMC_A16_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN5)
#define GPIO_FMC_A17_1           (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN2)
#define GPIO_FMC_A17_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN6)
#define GPIO_FMC_A18_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN3)
#define GPIO_FMC_A18_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN7)
#define GPIO_FMC_A19_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN4)
#define GPIO_FMC_A19_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN8)
#define GPIO_FMC_A20_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN15)
#define GPIO_FMC_A20_2           (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN7)
#define GPIO_FMC_A21_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN5)
#define GPIO_FMC_A21_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN9)
#define GPIO_FMC_A22_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN0)
#define GPIO_FMC_A22_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN10)
#define GPIO_FMC_A23_1           (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN1)
#define GPIO_FMC_A23_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN11)
#define GPIO_FMC_A24_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN14)
#define GPIO_FMC_A25_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN15)

#define GPIO_FMC_D0_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN12)
#define GPIO_FMC_D0_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN2)
#define GPIO_FMC_D1_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN11)
#define GPIO_FMC_D1_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN3)
#define GPIO_FMC_D2_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN10)
#define GPIO_FMC_D2_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN4)
#define GPIO_FMC_D3_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN9)
#define GPIO_FMC_D3_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN5)
#define GPIO_FMC_D4_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN8)
#define GPIO_FMC_D4_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN8)
#define GPIO_FMC_D5_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN2)
#define GPIO_FMC_D5_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN9)
#define GPIO_FMC_D6_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN1)
#define GPIO_FMC_D6_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN10)
#define GPIO_FMC_D7_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN0)
#define GPIO_FMC_D7_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN11)
#define GPIO_FMC_D8_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN13)
#define GPIO_FMC_D8_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN7)
#define GPIO_FMC_D9_1            (GPIO_ALT|GPIO_AF14|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN8)
#define GPIO_FMC_D9_2            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN12)
#define GPIO_FMC_D9_3            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN0)
#define GPIO_FMC_D10_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN11)
#define GPIO_FMC_D10_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN1)
#define GPIO_FMC_D11_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN10)
#define GPIO_FMC_D11_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN2)
#define GPIO_FMC_D12_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN5)
#define GPIO_FMC_D12_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN3)
#define GPIO_FMC_D13_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN4)
#define GPIO_FMC_D13_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN4)
#define GPIO_FMC_D14_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN3)
#define GPIO_FMC_D14_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN5)
#define GPIO_FMC_D15_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN15)
#define GPIO_FMC_D15_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN6)
#define GPIO_FMC_D16_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN11)
#define GPIO_FMC_D17_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN14)
#define GPIO_FMC_D18_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN15)
#define GPIO_FMC_D19_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN12)
#define GPIO_FMC_D20_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN13)
#define GPIO_FMC_D21_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN3)
#define GPIO_FMC_D22_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN4)
#define GPIO_FMC_D23_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN5)
#define GPIO_FMC_D24_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN7)
#define GPIO_FMC_D25_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN8)
#define GPIO_FMC_D26_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN9)
#define GPIO_FMC_D27_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN10)
#define GPIO_FMC_D28_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN11)
#define GPIO_FMC_D29_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN12)
#define GPIO_FMC_D30_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN13)
#define GPIO_FMC_D31_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN14)

#define GPIO_FMC_ALE_1           (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN6)
#define GPIO_FMC_CLE_1           (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN5)
#define GPIO_FMC_CLK_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN10)
#define GPIO_FMC_CLK_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN7)
#define GPIO_FMC_INT_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN7)
#define GPIO_FMC_INT_2           (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN6)
#define GPIO_FMC_INT_3           (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN13)
#define GPIO_FMC_NBL0_1          (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN8)
#define GPIO_FMC_NBL0_2          (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN1)
#define GPIO_FMC_NBL1_1          (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN0)
#define GPIO_FMC_NBL2_1          (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN6)
#define GPIO_FMC_NBL3_1          (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN15)
#define GPIO_FMC_NCE_1           (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN5)
#define GPIO_FMC_NE1_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN14)
#define GPIO_FMC_NE1_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN12)
#define GPIO_FMC_NE2_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN5)
#define GPIO_FMC_NE3_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN6)
#define GPIO_FMC_NE4_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN0)
#define GPIO_FMC_NL_1            (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN4)
#define GPIO_FMC_NOE_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN5)
#define GPIO_FMC_NOE_2           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN1)
#define GPIO_FMC_NWAIT_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN3)
#define GPIO_FMC_NWE_1           (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN2)
#define GPIO_FMC_SDCLK_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN9)
#define GPIO_FMC_SDCLK_2         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTN|GPIO_PIN6)
#define GPIO_FMC_SDCKE0_1        (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN15)
#define GPIO_FMC_SDCKE1_1        (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN7)
#define GPIO_FMC_SDNCAS_1        (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN13)
#define GPIO_FMC_SDNE0_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN14)
#define GPIO_FMC_SDNE1_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN6)
#define GPIO_FMC_SDNRAS_1        (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN12)
#define GPIO_FMC_SDNWE_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN11)

/* I2C */

#define GPIO_I2C1_SCL_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN6)
#define GPIO_I2C1_SCL_2          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN8)
#define GPIO_I2C1_SDA_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN7)
#define GPIO_I2C1_SDA_2          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN9)
#define GPIO_I2C1_SMBA_1         (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN5)

#define GPIO_I2C2_SCL_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN10)
#define GPIO_I2C2_SCL_2          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN1)
#define GPIO_I2C2_SDA_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN11)
#define GPIO_I2C2_SDA_2          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN0)
#define GPIO_I2C2_SMBA_1         (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN12)
#define GPIO_I2C2_SMBA_2         (GPIO_ALT|GPIO_AF4|GPIO_PORTF|GPIO_PIN2)

#define GPIO_I2C3_SCL_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTA|GPIO_PIN8)
#define GPIO_I2C3_SDA_1          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTA|GPIO_PIN9)
#define GPIO_I2C3_SDA_2          (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTC|GPIO_PIN9)
#define GPIO_I2C3_SMBA_1         (GPIO_ALT|GPIO_AF4|GPIO_PORTC|GPIO_PIN8)

/* I3C */

#define GPIO_I3C1_SCL_1          (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN6)
#define GPIO_I3C1_SCL_2          (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN8)
#define GPIO_I3C1_SDA_1          (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN7)
#define GPIO_I3C1_SDA_2          (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN9)

/* I2S */

