apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
/* Serial audio interface */

#define GPIO_SAI1_CK1_0          (GPIO_ALT|GPIO_AF2|GPIO_PORTE|GPIO_PIN2)
#define GPIO_SAI1_CK2_0          (GPIO_ALT|GPIO_AF2|GPIO_PORTE|GPIO_PIN5)
#define GPIO_SAI1_D1_1           (GPIO_ALT|GPIO_AF2|GPIO_PORTB|GPIO_PIN2)
#define GPIO_SAI1_D1_2           (GPIO_ALT|GPIO_AF2|GPIO_PORTC|GPIO_PIN1)
#define GPIO_SAI1_D1_3           (GPIO_ALT|GPIO_AF2|GPIO_PORTD|GPIO_PIN6)
#define GPIO_SAI1_D1_4           (GPIO_ALT|GPIO_AF2|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI1_D2_0           (GPIO_ALT|GPIO_AF2|GPIO_PORTE|GPIO_PIN4)
#define GPIO_SAI1_D3_1           (GPIO_ALT|GPIO_AF2|GPIO_PORTC|GPIO_PIN5)
#define GPIO_SAI1_D3_2           (GPIO_ALT|GPIO_AF2|GPIO_PORTF|GPIO_PIN10)
#define GPIO_SAI1_FS_A_0         (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN4)
#define GPIO_SAI1_FS_B_0         (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN9)
#define GPIO_SAI1_MCLK_A_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN2)
#define GPIO_SAI1_MCLK_A_2       (GPIO_ALT|GPIO_AF6|GPIO_PORTG|GPIO_PIN7)
#define GPIO_SAI1_MCLK_B_0       (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN7)
#define GPIO_SAI1_SCK_A_1        (GPIO_ALT|GPIO_AF6|GPIO_PORTD|GPIO_PIN6)
#define GPIO_SAI1_SCK_A_2        (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN5)
#define GPIO_SAI1_SCK_B_0        (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN8)
#define GPIO_SAI1_SD_A_1         (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN2)
#define GPIO_SAI1_SD_A_2         (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN1)
#define GPIO_SAI1_SD_A_3         (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI1_SD_B_1         (GPIO_ALT|GPIO_AF6|GPIO_PORTE|GPIO_PIN3)
#define GPIO_SAI1_SD_B_2         (GPIO_ALT|GPIO_AF6|GPIO_PORTF|GPIO_PIN6)

#define GPIO_SAI2_FS_A_0         (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN12)
#define GPIO_SAI2_FS_B_1         (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN12)
#define GPIO_SAI2_FS_B_2         (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN0)
#define GPIO_SAI2_FS_B_3         (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN13)
#define GPIO_SAI2_FS_B_4         (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN9)
#define GPIO_SAI2_MCLK_A_0       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN0)
#define GPIO_SAI2_MCLK_B_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN1)
#define GPIO_SAI2_MCLK_B_2       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI2_MCLK_B_3       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN14)
#define GPIO_SAI2_SCK_A_0        (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN13)
#define GPIO_SAI2_SCK_B_1        (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN2)
#define GPIO_SAI2_SCK_B_2        (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN12)
#define GPIO_SAI2_SD_A_0         (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN11)
#define GPIO_SAI2_SD_B_1         (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN0)
#define GPIO_SAI2_SD_B_2         (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN7)
#define GPIO_SAI2_SD_B_3         (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN11)
#define GPIO_SAI2_SD_B_4         (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN11)
#define GPIO_SAI2_SD_B_5         (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN10)

/* LPUART */

#define GPIO_LPUART1_CTS_1       (GPIO_ALT|GPIO_AF3|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN11)
#define GPIO_LPUART1_DE_1        (GPIO_ALT|GPIO_AF3|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_LPUART1_RTS_1       (GPIO_ALT|GPIO_AF3|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_LPUART1_RX_1        (GPIO_ALT|GPIO_AF3|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN10)
#define GPIO_LPUART1_RX_2        (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN7)
#define GPIO_LPUART1_TX_1        (GPIO_ALT|GPIO_AF3|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN9)
#define GPIO_LPUART1_TX_2        (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN6)

/* UART4 */

#define GPIO_UART4_CTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN0)
#define GPIO_UART4_CTS_2         (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN15)
#define GPIO_UART4_DE_1          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN15)
#define GPIO_UART4_DE_2          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN14)
#define GPIO_UART4_RTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN15)
#define GPIO_UART4_RTS_2         (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN14)
#define GPIO_UART4_RX_1          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN1)
#define GPIO_UART4_RX_2          (GPIO_ALT|GPIO_AF6|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN11)
#define GPIO_UART4_RX_3          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN8)
#define GPIO_UART4_RX_4          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN11)
#define GPIO_UART4_RX_5          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN0)
#define GPIO_UART4_TX_1          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN0)
#define GPIO_UART4_TX_2          (GPIO_ALT|GPIO_AF6|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN12)
#define GPIO_UART4_TX_3          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN9)
#define GPIO_UART4_TX_4          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN10)
#define GPIO_UART4_TX_5          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN1)

/* UART5 */

#define GPIO_UART5_CTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN9)
#define GPIO_UART5_DE_1          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN8)
#define GPIO_UART5_RTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN8)
#define GPIO_UART5_RX_1          (GPIO_ALT|GPIO_AF14|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN5)
#define GPIO_UART5_RX_2          (GPIO_ALT|GPIO_AF14|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN12)
#define GPIO_UART5_RX_3          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN2)
#define GPIO_UART5_TX_1          (GPIO_ALT|GPIO_AF14|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN6)
#define GPIO_UART5_TX_2          (GPIO_ALT|GPIO_AF14|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN7)
#define GPIO_UART5_TX_3          (GPIO_ALT|GPIO_AF14|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN13)
#define GPIO_UART5_TX_4          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN12)

/* UART7 */

