apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
#define GPIO_UART7_CTS_1         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN10)
#define GPIO_UART7_CTS_2         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN9)
#define GPIO_UART7_DE_1          (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN9)
#define GPIO_UART7_DE_2          (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN8)
#define GPIO_UART7_RTS_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN9)
#define GPIO_UART7_RTS_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN8)
#define GPIO_UART7_RX_1          (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN8)
#define GPIO_UART7_RX_2          (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN3)
#define GPIO_UART7_RX_3          (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN7)
#define GPIO_UART7_RX_4          (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN6)
#define GPIO_UART7_RX_5          (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTM|GPIO_PIN8)
#define GPIO_UART7_TX_1          (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN15)
#define GPIO_UART7_TX_2          (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN4)
#define GPIO_UART7_TX_3          (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN8)
#define GPIO_UART7_TX_4          (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN7)
#define GPIO_UART7_TX_5          (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTM|GPIO_PIN9)

/* UART8 */

#define GPIO_UART8_CTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN14)
#define GPIO_UART8_DE_1          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN15)
#define GPIO_UART8_RTS_1         (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN15)
#define GPIO_UART8_RX_1          (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN0)
#define GPIO_UART8_TX_1          (GPIO_ALT|GPIO_AF8|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTE|GPIO_PIN1)

/* USART1 */

#define GPIO_USART1_CTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN11)
#define GPIO_USART1_CTS_2        (GPIO_ALT|GPIO_AF4|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN14)
#define GPIO_USART1_DE_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_USART1_DE_2         (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN15)
#define GPIO_USART1_RTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_USART1_RTS_2        (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN15)
#define GPIO_USART1_RX_1         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN10)
#define GPIO_USART1_RX_2         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN7)
#define GPIO_USART1_RX_3         (GPIO_ALT|GPIO_AF4|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN15)
#define GPIO_USART1_RX_4         (GPIO_ALT|GPIO_AF4|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN12)
#define GPIO_USART1_TX_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN9)
#define GPIO_USART1_TX_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN6)
#define GPIO_USART1_TX_3         (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN14)
#define GPIO_USART1_TX_4         (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTF|GPIO_PIN13)

/* USART2 */

#define GPIO_USART2_CTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN0)
#define GPIO_USART2_CTS_2        (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN3)
#define GPIO_USART2_DE_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN1)
#define GPIO_USART2_DE_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN4)
#define GPIO_USART2_RTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN1)
#define GPIO_USART2_RTS_2        (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN4)
#define GPIO_USART2_RX_1         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN3)
#define GPIO_USART2_RX_2         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN6)
#define GPIO_USART2_TX_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN2)
#define GPIO_USART2_TX_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN5)

/* USART3 */

#define GPIO_USART3_CTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN13)
#define GPIO_USART3_CTS_2        (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN11)
#define GPIO_USART3_DE_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN14)
#define GPIO_USART3_DE_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN12)
#define GPIO_USART3_RTS_1        (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN14)
#define GPIO_USART3_RTS_2        (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN12)
#define GPIO_USART3_RX_1         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN11)
#define GPIO_USART3_RX_2         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN11)
#define GPIO_USART3_RX_3         (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN9)
#define GPIO_USART3_TX_1         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN10)
#define GPIO_USART3_TX_2         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN10)
#define GPIO_USART3_TX_3         (GPIO_ALT|GPIO_AF7|GPIO_PUSHPULL|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN8)

/* SDMMC1 */

#define GPIO_SDMMC1_CKIN_1       (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN8)
#define GPIO_SDMMC1_CDIR_1       (GPIO_ALT|GPIO_AF7|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN9)
#define GPIO_SDMMC1_CK_1         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN12)
#define GPIO_SDMMC1_CMD_1        (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN2)
#define GPIO_SDMMC1_D0_1         (GPIO_ALT|GPIO_AF6|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN13)
#define GPIO_SDMMC1_D0_2         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN8)
#define GPIO_SDMMC1_D1_1         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN9)
#define GPIO_SDMMC1_D2_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN10)
#define GPIO_SDMMC1_D3_1         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN11)
#define GPIO_SDMMC1_D4_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN8)
#define GPIO_SDMMC1_D5_1         (GPIO_ALT|GPIO_AF12|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN9)
#define GPIO_SDMMC1_D6_1         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN6)
#define GPIO_SDMMC1_D7_1         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN7)
#define GPIO_SDMMC1_D0DIR_1      (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN6)
#define GPIO_SDMMC1_D123DIR_1    (GPIO_ALT|GPIO_AF8|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN7)

