apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7rsxx_pinmap.h
/* SDMMC2 */

#define GPIO_SDMMC2_CK_1         (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN1)
#define GPIO_SDMMC2_CK_2         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN6)
#define GPIO_SDMMC2_CMD_1        (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTA|GPIO_PIN0)
#define GPIO_SDMMC2_CMD_2        (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTD|GPIO_PIN7)
#define GPIO_SDMMC2_D0_1         (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN14)
#define GPIO_SDMMC2_D0_2         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN9)
#define GPIO_SDMMC2_D1_1         (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN15)
#define GPIO_SDMMC2_D1_2         (GPIO_ALT|GPIO_AF11|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN10)
#define GPIO_SDMMC2_D2_1         (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN3)
#define GPIO_SDMMC2_D2_2         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN11)
#define GPIO_SDMMC2_D3_1         (GPIO_ALT|GPIO_AF9|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN4)
#define GPIO_SDMMC2_D3_2         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN12)
#define GPIO_SDMMC2_D4_1         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN8)
#define GPIO_SDMMC2_D5_1         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTB|GPIO_PIN9)
#define GPIO_SDMMC2_D6_1         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN6)
#define GPIO_SDMMC2_D6_2         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN13)
#define GPIO_SDMMC2_D7_1         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTC|GPIO_PIN7)
#define GPIO_SDMMC2_D7_2         (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PORTG|GPIO_PIN14)

/* USB Type-C */

#define GPIO_UCPD1_CC1_0         (GPIO_ANALOG|GPIO_PORTM|GPIO_PIN0)
#define GPIO_UCPD1_CC2_0         (GPIO_ANALOG|GPIO_PORTM|GPIO_PIN1)

/* USB OTG */

#define GPIO_OTGFS_SOF_0         (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN8)
#define GPIO_OTGFS_DP_0          (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTM|GPIO_PIN11)
#define GPIO_OTGFS_DM_0          (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTM|GPIO_PIN12)
#define GPIO_OTGFS_ID_0          (GPIO_ALT|GPIO_AF10|GPIO_OPENDRAIN|GPIO_PULLUP|GPIO_PORTM|GPIO_PIN13)
#define GPIO_OTGFS_VBUS_0        (GPIO_ALT|GPIO_AF10|GPIO_PORTM|GPIO_PIN14)

#define GPIO_OTGHS_SOF_0         (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN4)
#define GPIO_OTGHS_DM_0          (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTM|GPIO_PIN5)
#define GPIO_OTGHS_DP_0          (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTM|GPIO_PIN6)
#define GPIO_OTGHS_VBUS_0        (GPIO_ALT|GPIO_AF10|GPIO_PORTM|GPIO_PIN8)
#define GPIO_OTGHS_ID_0          (GPIO_ALT|GPIO_AF10|GPIO_OPENDRAIN|GPIO_PULLUP|GPIO_PORTM|GPIO_PIN9)

/* XSPI1 */

#define GPIO_XSPI1_NCS_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTO|GPIO_PIN0)
#define GPIO_XSPI1_NCS_2         (GPIO_ALT|GPIO_AF9|GPIO_PORTO|GPIO_PIN1)
#define GPIO_XSPI1_DQS_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTO|GPIO_PIN2)
#define GPIO_XSPI1_CLK_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTO|GPIO_PIN4)
#define GPIO_XSPI1_NCLK_1        (GPIO_ALT|GPIO_AF9|GPIO_PORTO|GPIO_PIN5)
#define GPIO_XSPI1_IO0_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN0)
#define GPIO_XSPI1_IO1_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN1)
#define GPIO_XSPI1_IO2_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN2)
#define GPIO_XSPI1_IO3_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN3)
#define GPIO_XSPI1_IO4_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN4)
#define GPIO_XSPI1_IO5_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN5)
#define GPIO_XSPI1_IO6_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN6)
#define GPIO_XSPI1_IO7_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTP|GPIO_PIN7)

/* XSPI2 */

#define GPIO_XSPI2_DQS_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN0)
#define GPIO_XSPI2_NCS_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN1)
#define GPIO_XSPI2_NCS_2         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN12)
#define GPIO_XSPI2_IO0_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN2)
#define GPIO_XSPI2_IO1_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN3)
#define GPIO_XSPI2_IO2_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN4)
#define GPIO_XSPI2_IO3_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN5)
#define GPIO_XSPI2_CLK_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN6)
#define GPIO_XSPI2_NCLK_1        (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN7)
#define GPIO_XSPI2_IO4_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN8)
#define GPIO_XSPI2_IO5_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN9)
#define GPIO_XSPI2_IO6_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN10)
#define GPIO_XSPI2_IO7_1         (GPIO_ALT|GPIO_AF9|GPIO_PORTN|GPIO_PIN11)

#endif /* CONFIG_STM32_STM32H7RSXX */

#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7RSXX_PINMAP_H */
